gutanclan/stm32Bootloader/drivers/rtc/rtc.c
//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!    \file        Rtc.c
//!    \brief       Functions for Real Time Clock (RTC).
//!
//!    \author
//!    \date
//!
//!    \notes
//!
//!
//////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
// Header include
//////////////////////////////////////////////////////////////////////////////////////////////////

// C Library includes
#include <stdio.h>
#include <string.h>
#include <time.h>

//#include "../includesProject.h"
#include "../../hal/stm32f2xx_conf.h"     // Macro: assert_param() for other STM libraries.
#include "../common/Types.h"

#include "rtc.h"

//////////////////////////////////////////////////////////////////////////////////////////////////
// File Local DEFINES
//////////////////////////////////////////////////////////////////////////////////////////////////

#define RTC_BACKUP_DATA_REGS_AMOUNT             (20)

#define RTC_INTERRUPT_PREEMPTION_PRIORITY       (0)
#define RTC_INTERRUPT_TIME_MATCH_SUB_PRIORITY   (0x0F)

//////////////////////////////////////////////////////////////////////////////////////////////////
// File Local Variable
//////////////////////////////////////////////////////////////////////////////////////////////////

typedef enum
{
    RTC_CONFIG_OSC_PLL,
    RTC_CONFIG_TIME_SYNC,

    RTC_CONFIG_MAX
}RtcConfigEnum;

static const UINT32         dwBakupDataRegisters[RTC_BACKUP_DATA_REGS_AMOUNT] =
{
    RTC_BKP_DR0,    RTC_BKP_DR1,    RTC_BKP_DR2,
    RTC_BKP_DR3,    RTC_BKP_DR4,    RTC_BKP_DR5,
    RTC_BKP_DR6,    RTC_BKP_DR7,    RTC_BKP_DR8,
    RTC_BKP_DR9,    RTC_BKP_DR10,   RTC_BKP_DR11,
    RTC_BKP_DR12,   RTC_BKP_DR13,   RTC_BKP_DR14,
    RTC_BKP_DR15,   RTC_BKP_DR16,   RTC_BKP_DR17,
    RTC_BKP_DR18,   RTC_BKP_DR19
};

static RtcClockSourceEnum   geCurrentSourceClock            = RTC_SOURCE_CLOCK_UNKNOWN;
volatile static UINT32      gdwInterruptWKUPRolloverCounter = 0;
static BOOL                 gfIsInterruptTimeMatchEnabled   = FALSE;

//////////////////////////////////////////////////////////////////////////////////////////////////
// File Local Functions
//////////////////////////////////////////////////////////////////////////////////////////////////

static BOOL RtcSetBackupRegister( UINT8 bBkpRegIndex, UINT32 dwValue );
static BOOL RtcGetBackupRegister( UINT8 bBkpRegIndex, UINT32 *pdwValue );
static BOOL RtcConfig           ( RtcClockSourceEnum eSourceClock, RtcConfigEnum eConfigType );

// Interruptions should not be static
void        RTC_Alarm_IRQHandler( void );
void        RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_IRQ_HNDLR    ( void );

///////////////////////////////// FUNCTION DESCRIPTION /////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcInitialize( RtcClockSourceEnum eSourceClock )
//!
//! \brief  Initialize Rtc peripheral
//!
//! \param[in]  eSourceClock   Indicate the source clock for rtc (LSI or LSE)
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcInitialize( RtcClockSourceEnum eSourceClock )
{
    BOOL        fSuccess            = FALSE;
    BOOL        fIsRtcConfigured    = FALSE;

    if( eSourceClock < RTC_SOURCE_CLOCK_MAX )
    {
        //////////////////////////////////////////////////
        // check if registers are configured correctly
        //////////////////////////////////////////////////
        // NOTE: Last time this library was tested,
        // LSI was not holding its configured values
        // after any reset, even with power ON all the time.
        // (LSE working fine!!)
        fIsRtcConfigured = TRUE;
        fIsRtcConfigured &= RtcIsRtcConfigured();
        fIsRtcConfigured &=                                                     // check Any of the oscillators is ready
        (
            ( RCC_GetFlagStatus(RCC_FLAG_LSERDY) == SET ) ||
            ( RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == SET )
        );
        fIsRtcConfigured &= ( ( ( RCC->BDCR & 0x300 ) >> 8 ) == eSourceClock ) ;// check the OSC selected matches with the one config in register
        //////////////////////////////////////////////////

        if( fIsRtcConfigured )
        {
            // Rtc already configured
            fSuccess = RtcConfig( eSourceClock, RTC_CONFIG_TIME_SYNC );
        }
        else
        {
            fSuccess = RtcConfig( eSourceClock, RTC_CONFIG_OSC_PLL );

            // SET time for first time
            RtcSetBackupRegister( 0, 0 );              // Clear RTC configured BCKUP REG

            if( fSuccess )
            {
                RtcDateTimeStruct tDateTime;

                RtcDateTimeStructInit( &tDateTime );

                // Set preferred default start time for demos
                RtcDateTimeStructInit( &tDateTime );
                fSuccess = RtcDateTimeSet( &tDateTime );

                RtcSetBackupRegister( 0, 1 );              // Indicate RTC has been configured
            }
        }
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcSourceClockSet( RtcClockSourceEnum eSourceClock )
//!
//! \brief  set the clock source for RTC
//!
//! \param[in]  eSourceClock   source clock for rtc (LSI or LSE)
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcSourceClockSet( RtcClockSourceEnum eSourceClock )
{
    BOOL fSuccess = FALSE;

    fSuccess = RtcConfig( eSourceClock, RTC_CONFIG_OSC_PLL );

    if( fSuccess )
    {
        // set global source clock variable
        geCurrentSourceClock = eSourceClock;
    }

