gutanclan/stm32Bootloader/drivers/rtc/rtc.c
    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcSourceClockGet( RtcClockSourceEnum *peSourceClock )
//!
//! \brief  returns the clock source of the RTC
//!
//! \param[in]  *peSourceClock   source clock variable
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RtcSourceClockGet( RtcClockSourceEnum *peSourceClock )
{
    if( peSourceClock != NULL )
    {
        *peSourceClock = geCurrentSourceClock;
    }
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcIsRtcConfigured( void )
//!
//! \brief  indicates if the RTC peripheralhas been configured
//!
//! \param[in]  void
//!
//! \return BOOL
//!             TRUE if RTC configured already
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcIsRtcConfigured( void )
{
    BOOL    fIsRtcConfigured    = FALSE;
    UINT32  dwValue             = 0;

    RtcGetBackupRegister( 0, &dwValue );

    if( dwValue == 0x01 )
    {
        fIsRtcConfigured = TRUE;
    }

    #warning find another way to indicate rtc is configured. check which register can be read
    //return fIsRtcConfigured;
    return TRUE;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcIsRtcConfigured( void )
//!
//! \brief  configures the RTC peripheral
//!
//! \param[in]  eSourceClock   source clock for rtc (LSI or LSE)
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcConfig( RtcClockSourceEnum eSourceClock, RtcConfigEnum eConfigType )
{
    BOOL    fSuccess        = FALSE;
    UINT32  dwWaitingTime   = 0;
    BOOL    fErrorFlag      = FALSE; // for debugging errors on waiting times.

    if( eSourceClock < RTC_SOURCE_CLOCK_MAX )
    {
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_PWR, ENABLE );           // Enable the PWR clock (Peripheral Clock)

        if( eConfigType == RTC_CONFIG_OSC_PLL )
        {
            // reset the whole Backup domain (RTCSEL,RTCEN,LSE LSI ENABLED)
            // Once the RTC clock source has been selected, it cannot be changed
            // anymore unless the Backup domain is reset.
            RCC_BackupResetCmd( ENABLE );
            RCC_BackupResetCmd( DISABLE );
            //after Reset, backup domain is write-protected, therefore remove the lock on BCKUP domain: PWR_BackupAccessCmd()
        }

        PWR_BackupAccessCmd( ENABLE );                                  // Allow access to RTC Domain

        if( eConfigType == RTC_CONFIG_OSC_PLL )
        {
            /////////////////////////////////////////////////
            // CONFIGURE CLOCK SOURCES
            /////////////////////////////////////////////////
            if( eSourceClock == RTC_SOURCE_CLOCK_LSE )
            {
                RCC_LSEConfig( RCC_LSE_ON );                                // Enable the LSE OSC

                dwWaitingTime = 100000;
                while( (RCC_GetFlagStatus( RCC_FLAG_LSERDY ) == RESET) && (dwWaitingTime--) );     // Wait till LSE is ready

                if( dwWaitingTime == 0 )
                {
                    // error, waiting time finished
                    fErrorFlag = TRUE;
                }

                RCC_RTCCLKConfig( RCC_RTCCLKSource_LSE );                   // Select the RTC Clock Source
            }
            else
            {
                RCC_LSICmd( ENABLE );                                       // Enable the LSI OSC

                dwWaitingTime = 100000;
                while( ( RCC_GetFlagStatus( RCC_FLAG_LSIRDY ) == RESET ) && (dwWaitingTime--) );     // Wait till LSI is ready

                if( dwWaitingTime == 0 )
                {
                    // error, waiting time finished
                    fErrorFlag = TRUE;
                }

                RCC_RTCCLKConfig( RCC_RTCCLKSource_LSI );
            }

            RCC_RTCCLKCmd( ENABLE );                                        // Enable the RTC Clock

            /////////////////////////////////////////////////
            /////////////////////////////////////////////////
        }

        dwWaitingTime = 1000;
        while( RTC_WaitForSynchro() == FALSE && (dwWaitingTime--) );        // Wait for RTC APB registers synchronisation

        if( dwWaitingTime == 0 )
        {
            // error, waiting time finished
            fErrorFlag = TRUE;
        }
        else
        {
            fSuccess = TRUE;
        }

        if( eConfigType == RTC_CONFIG_OSC_PLL )
        {
            if( fSuccess )
            {
                /////////////////////////////////////////////////
                // CONFIGURE RTC REGS AND PRESCALLER
                /////////////////////////////////////////////////
                RTC_InitTypeDef RTC_InitStructure;

                RTC_StructInit( &RTC_InitStructure );                           //RTC structure initialized to default values

                // Set the RTC time base to 1s
                RTC_InitStructure.RTC_AsynchPrediv  = 0x7F;                     // Specifies the RTC Asynchronous Predivider value.
                RTC_InitStructure.RTC_SynchPrediv   = 0xFF;                     // Specifies the RTC Synchronous Predivider value.
                RTC_InitStructure.RTC_HourFormat    = RTC_HourFormat_24;

                if( RTC_Init( &RTC_InitStructure ) != ERROR )                   // Check on RTC init
                {
                    fSuccess = TRUE;
                }
            }
        }
    }

    return fSuccess;
}


//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcDateTimeStructInit( RtcDateTimeStruct * ptDateTime )
//!
//! \brief  Initialize RtcDateTimeStruct to default values
//!
//! \param[in]  ptDateTime      Rtc time structure
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RtcDateTimeStructInit( RtcDateTimeStruct * ptDateTime )
{
    if( ptDateTime != NULL )
    {
        ptDateTime->bSecond     = 0;
        ptDateTime->bMinute     = 0;
        ptDateTime->bHour       = 0;
        ptDateTime->eDayOfWeek  = RTC_DAY_MONDAY;
        ptDateTime->bDate       = 1;
        ptDateTime->eMonth      = RTC_MONTH_JANUARY;
        ptDateTime->bYear       = 0;
    }
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcIsDateTimeValid( RtcDateTimeStruct * ptDateTime )
//!
//! \brief  returns if the Date Time are valid
//!
//! \param[in]  ptDateTime   structure pointer that contains date and time
//!
//! \return BOOL
//!             TRUE if valid date time
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcIsDateTimeValid( RtcDateTimeStruct * ptDateTime )
{
    BOOL fAreParamsValid = FALSE;

    if( ptDateTime != NULL )
    {
        fAreParamsValid = TRUE;
        fAreParamsValid &= ( ( ptDateTime->bSecond >= 0 )   && ( ptDateTime->bSecond <= 59 ) );
        fAreParamsValid &= ( ( ptDateTime->bMinute >= 0 )   && ( ptDateTime->bMinute <= 59 ) );
        fAreParamsValid &= ( ( ptDateTime->bHour >= 0 )     && ( ptDateTime->bHour <= 23 ) );
        fAreParamsValid &= ( ( ptDateTime->bDate >= 1 )     && ( ptDateTime->bDate <= 31 ) );
        fAreParamsValid &= ( ( ptDateTime->bYear >= 0 )     && ( ptDateTime->bYear <= 99 ) );
        fAreParamsValid &= ( ( ptDateTime->eMonth >= RTC_MONTH_JANUARY )    && ( ptDateTime->eMonth <= RTC_MONTH_DECEMBER ) );
        fAreParamsValid &= ( ( ptDateTime->eDayOfWeek >= RTC_DAY_MONDAY )   && ( ptDateTime->eDayOfWeek <= RTC_DAY_SUNDAY ) );
    }

    return fAreParamsValid;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcDateTimeGet( RtcDateTimeStruct *ptDateTime )
//!
//! \brief  returns the Date Time of the RTC
//!
//! \param[in]  ptDateTime   structure pointer that contains date and time
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcDateTimeGet( RtcDateTimeStruct *ptDateTime )
{
    BOOL fSuccess = FALSE;

    if( ptDateTime != NULL )
    {
        if( ( RtcIsRtcConfigured() == TRUE ) && ( RTC_GetFlagStatus( RTC_FLAG_RSF ) == SET ) )
        {
            RTC_TimeTypeDef RTC_TimeStructure;
            RTC_DateTypeDef RTC_DateStructure;

