gutanclan/stm32Bootloader/drivers/rtc/rtc.c
            RTC_GetTime( RTC_Format_BIN, &RTC_TimeStructure );          // Get the current Time and lock the Date
            RTC_GetDate( RTC_Format_BIN, &RTC_DateStructure );          // Get the current Date

            RtcDateTimeStructInit( ptDateTime );

            ptDateTime->bYear       = RTC_DateStructure.RTC_Year;
            ptDateTime->eMonth      = RTC_DateStructure.RTC_Month;
            ptDateTime->bDate       = RTC_DateStructure.RTC_Date;
            ptDateTime->eDayOfWeek  = RTC_DateStructure.RTC_WeekDay;
            ptDateTime->bHour       = RTC_TimeStructure.RTC_Hours;
            ptDateTime->bMinute     = RTC_TimeStructure.RTC_Minutes;
            ptDateTime->bSecond     = RTC_TimeStructure.RTC_Seconds;

            fSuccess = RtcIsDateTimeValid( ptDateTime );
        }
    }

    if( fSuccess != TRUE )
    {
        // Time invalid. Set safe values.
        RtcDateTimeStructInit( ptDateTime );
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcDateTimeSet( RtcDateTimeStruct *ptDateTime )
//!
//! \brief  sets the Date Time of the RTC
//!
//! \param[in]  ptDateTime   structure pointer that contains date and time
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcDateTimeSet( RtcDateTimeStruct *ptDateTime )
{
    BOOL fSuccess = FALSE;

    if ( ptDateTime != NULL )
    {
        RTC_TimeTypeDef RTC_TimeStructure;
        RTC_DateTypeDef RTC_DateStructure;

        if( RtcIsDateTimeValid( ptDateTime ) == TRUE )
        {
            // Populate RTC original structure
            RTC_TimeStructure.RTC_Seconds   = ptDateTime->bSecond;
            RTC_TimeStructure.RTC_Minutes   = ptDateTime->bMinute;
            RTC_TimeStructure.RTC_Hours     = ptDateTime->bHour;
            RTC_DateStructure.RTC_WeekDay   = ptDateTime->eDayOfWeek;
            RTC_DateStructure.RTC_Date      = ptDateTime->bDate;
            RTC_DateStructure.RTC_Month     = ptDateTime->eMonth;
            RTC_DateStructure.RTC_Year      = ptDateTime->bYear;

            // Allow access to RTC Domain (RTC registers)
            PWR_BackupAccessCmd( ENABLE );

            fSuccess = RTC_SetTime( RTC_Format_BIN, &RTC_TimeStructure );
            fSuccess &= RTC_SetDate( RTC_Format_BIN, &RTC_DateStructure );
        }
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     UINT32 RtcDateTimeToEpochSeconds( RtcDateTimeStruct *ptDateTime )
//!
//! \brief  Convert a given date time struct to seconds
//!
//! \param[in]  ptDataRecord      Pointer to the structure date time
//!
//! \return UINT32, Number of seconds since Jan. 1st 1970
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
UINT32 RtcDateTimeToEpochSeconds( RtcDateTimeStruct *ptDateTime )
{
    UINT32          dwSeconds       = 0;
    struct tm       tTimeStructure;
    time_t          tTimeSeconds;

    if( ptDateTime != NULL )
    {
        tTimeStructure.tm_sec       = ptDateTime->bSecond;
        tTimeStructure.tm_min       = ptDateTime->bMinute;
        tTimeStructure.tm_hour      = ptDateTime->bHour;
        tTimeStructure.tm_mday      = ptDateTime->bDate;                // Day of Month is 1-based
        tTimeStructure.tm_mon       = ptDateTime->eMonth - 1;           // Month must be 0-based
        tTimeStructure.tm_year      = ((UINT16) ptDateTime->bYear) + (RTC_CENTURY_OFFSET - 1900); // tm_year must be years since 1900
        tTimeStructure.tm_wday      = ptDateTime->eDayOfWeek;
        tTimeStructure.tm_yday      = 0;                                // mktime() function doesn't require this parameter to be set
        tTimeStructure.tm_isdst     = 0;                                // mktime() function doesn't require this parameter to be set

        // convert date time to EPOCH seconds
        tTimeSeconds                = mktime( &tTimeStructure );

        if( tTimeSeconds == -1 )
        {
            dwSeconds = 0;
        }
        else
        {
            dwSeconds = tTimeSeconds;
        }
    }

    return dwSeconds;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcEpochSecondsToDateTime( UINT32 dwEpochSecs, RtcDateTimeStruct *ptDateTime )
//!
//! \brief  Convert a given Epoch seconds into a date time struct
//!
//! \param[in]  dwEpochSecs       Epoch seconds
//!
//! \param[in]  ptDataRecord      Pointer to the structure date time
//!
//! \return UINT32, Number of seconds since Jan. 1st 1970
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcEpochSecondsToDateTime( UINT32 dwEpochSecs, RtcDateTimeStruct *ptDateTime )
{
    BOOL        fSuccess    = FALSE;
    time_t      tTimeSeconds= 0;
    struct tm   tTimeStruct;

    // set time in seconds
    tTimeSeconds = dwEpochSecs;

    // convert to time structure
    tTimeStruct =* localtime( &tTimeSeconds );

    ptDateTime->bYear       = tTimeStruct.tm_year - (RTC_CENTURY_OFFSET-1900); // tm_year must be years since 1900
    ptDateTime->eMonth      = tTimeStruct.tm_mon + 1;
    ptDateTime->bDate       = tTimeStruct.tm_mday;
    ptDateTime->eDayOfWeek  = tTimeStruct.tm_wday;
    ptDateTime->bHour       = tTimeStruct.tm_hour;
    ptDateTime->bMinute     = tTimeStruct.tm_min;
    ptDateTime->bSecond     = tTimeStruct.tm_sec;

    fSuccess = RtcIsDateTimeValid( ptDateTime );

    return fSuccess;
}

/* //////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcInterruptPinA0Enable( BOOL fInputPinEnable )
//!
//! \brief  Enables/ Disable the pin interruption PA0
//!
//! \param[in]  fInputPinEnable   TRUE=ENABLE / FALSE=DISABLE
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RtcInterruptPinA0Enable( BOOL fInputPinEnable )
{
    GPIO_InitTypeDef    GPIO_InitStructure;
    EXTI_InitTypeDef    EXTI_InitStructure;
    NVIC_InitTypeDef    NVIC_InitStructure;
    /////////////////////////////////////////////////
    // CONFIGURE GPIO
    /////////////////////////////////////////////////
    // Initialized to defualt values
    GPIO_StructInit( &GPIO_InitStructure );
    // Enable clock
    RCC_AHB1PeriphClockCmd( RTC_INT_WAKEUP_REED_WITCH_1_RCC, ENABLE );

