gutanclan/stm32Bootloader/drivers/rtc/rtc.c
    // #### SET PIN MODE ####
    GPIO_InitStructure.GPIO_Mode    = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_Pin     = RTC_INT_WAKEUP_REED_WITCH_1_PIN;
    GPIO_InitStructure.GPIO_Speed   = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_OType   = GPIO_OType_PP;   // dont care for input
    GPIO_InitStructure.GPIO_PuPd    = GPIO_PuPd_NOPULL;
    GPIO_Init( RTC_INT_WAKEUP_REED_WITCH_1_PORT, &GPIO_InitStructure );

    /////////////////////////////////////////////////
    // CONFIGURE GPIO EXTI
    /////////////////////////////////////////////////
    // Connect Button EXTI Line to GPIO Pin
    //SYSCFG_EXTILineConfig( RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_PORT, GPIO_PinSource0 );
    SYSCFG_EXTILineConfig( RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_PORT, RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_PIN );
    // Configure Button EXTI line
    RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_RCC_INIT();

    EXTI_InitStructure.EXTI_Line    = RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_LINE;
    EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init( &EXTI_InitStructure );

    /////////////////////////////////////////////////
    // CONFIGURE NVIC INTERRUPT VECTOR
    /////////////////////////////////////////////////
    // Enable the RTC Alarm Interrupt
    NVIC_InitStructure.NVIC_IRQChannel                      = RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_IRQ;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = RTC_INTERRUPT_PREEMPTION_PRIORITY;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority           = RTC_INTERRUPT_PA0_SUB_PRIORITY;
    if( fInputPinEnable == TRUE )
    {
        NVIC_InitStructure.NVIC_IRQChannelCmd   = ENABLE;

        gfIsInterruptPA0Enabled                 = TRUE;
    }
    else
    {
        NVIC_InitStructure.NVIC_IRQChannelCmd   = DISABLE;

        gfIsInterruptPA0Enabled                 = FALSE;
    }

    NVIC_Init( &NVIC_InitStructure );
} */

#if(0)
//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcInterruptOnTimeMatch( RtcInterruptOnTimeMatchEnum eTimeMatchType, UINT8 bMatchValue )
//!
//! \brief  Enables/ Disable the time match interruption
//!
//! \param[in]  eTimeMatchType   type of time match from RtcInterruptWkupOnTimeMatchEnum;
//!
//! \param[in]  bMatchValue      time when interruption will occur. At XX:XX:ValSecond or XX:ValMinute:XX or ValHour:XX:XX
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcAlarmTimeMatchSetTime( RtcAlarmTypeEnum eAlarmType, BOOL fIsAlarmEnabled, RtcAlarmTimeMatchType *ptAlarmConfig )
{
    BOOL fSuccess = FALSE;

    if
    (
        ( RtcAlarmTypeEnum < RTC_ALARM_TYPE_MAX ) &&
        ( NULL != ptAlarmConfig )
    )
    {
        EXTI_InitTypeDef    EXTI_InitStructure;
        NVIC_InitTypeDef    NVIC_InitStructure;
        RTC_AlarmTypeDef    RTC_AlarmStructure;

        // Config Commons
        NVIC_InitStructure.NVIC_IRQChannel                      = RTC_Alarm_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = RTC_INTERRUPT_PREEMPTION_PRIORITY;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority           = RTC_INTERRUPT_TIME_MATCH_SUB_PRIORITY;

        RTC_AlarmStructInit( &RTC_AlarmStructure );

        if( fIsAlarmEnabled )
        {
            if( eTimeMatchType != RTC_INT_WKUP_ON_TIME_MATCH_NONE )
            {
                RTC_AlarmCmd( RTC_Alarm_A, DISABLE );   // Disable the Alarm A
                RTC_ITConfig( RTC_IT_ALRA, DISABLE );   // Enable the RTC Wakeup Interrupt
                RTC_ClearITPendingBit( RTC_IT_ALRA );


            }
        }
        else
        {

        }
    }

    return fSuccess;
}

BOOL RtcInterruptOnTimeMatch( RtcInterruptOnTimeMatchEnum eTimeMatchType, UINT8 bMatchValue )
{
    BOOL fSuccess = FALSE;

    if( eTimeMatchType < RTC_ON_TIME_MATCH_MAX )
    {
        EXTI_InitTypeDef    EXTI_InitStructure;
        NVIC_InitTypeDef    NVIC_InitStructure;
        RTC_AlarmTypeDef    RTC_AlarmStructure;

        // Config Commons
        NVIC_InitStructure.NVIC_IRQChannel                      = RTC_Alarm_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = RTC_INTERRUPT_PREEMPTION_PRIORITY;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority           = RTC_INTERRUPT_TIME_MATCH_SUB_PRIORITY;

        if( eTimeMatchType != RTC_INT_WKUP_ON_TIME_MATCH_NONE )
        {
            /////////////////////////////////////////////////
            // CONFIGURE ALARM CLOCK
            /////////////////////////////////////////////////
            RTC_AlarmCmd( RTC_Alarm_A, DISABLE );   // Disable the Alarm A
            RTC_ITConfig( RTC_IT_ALRA, DISABLE );   // Enable the RTC Wakeup Interrupt
            RTC_ClearITPendingBit( RTC_IT_ALRA );

            /////////////////////////////////////////////////
            // CALCULATE ALARM TIMES
            /////////////////////////////////////////////////
            RTC_AlarmStructInit( &RTC_AlarmStructure );

            switch( eTimeMatchType )
            {
                case RTC_INT_WKUP_ON_TIME_MATCH_SECOND:
                    // sanity check
                    if( bMatchValue < 60 )
                    {
                        RTC_AlarmStructure.RTC_AlarmTime.RTC_Seconds    = bMatchValue;
                        // clear the mask bit that wants to be used to trigger interruption
                        RTC_AlarmStructure.RTC_AlarmMask                = (RTC_AlarmMask_All & (~RTC_AlarmMask_Seconds));
                        fSuccess = TRUE;
                    }
                    break;
                case RTC_INT_WKUP_ON_TIME_MATCH_MINUTE:
                    if( bMatchValue < 60 )
                    {
                        RTC_AlarmStructure.RTC_AlarmTime.RTC_Minutes    = bMatchValue;
                        // clear the mask bit that wants to be used to trigger interruption
                        RTC_AlarmStructure.RTC_AlarmMask                = (RTC_AlarmMask_All & (~RTC_AlarmMask_Minutes));
                        fSuccess = TRUE;
                    }
                    break;
                case RTC_INT_WKUP_ON_TIME_MATCH_HOUR:
                    if( bMatchValue < 24 )
                    {
                        RTC_AlarmStructure.RTC_AlarmTime.RTC_Hours      = bMatchValue;
                        // clear the mask bit that wants to be used to trigger interruption
                        RTC_AlarmStructure.RTC_AlarmMask                = (RTC_AlarmMask_All & (~RTC_AlarmMask_Hours));
                        fSuccess = TRUE;
                    }
                    break;
                default:
                    // Error:option not recognized
                    break;
            }

