gutanclan/stm32Bootloader/drivers/rtc/rtc.c
            if( fSuccess == TRUE )
            {
                // Configure the RTC Alarm A register
                RTC_SetAlarm( RTC_Format_BIN, RTC_Alarm_A, &RTC_AlarmStructure );

                RTC_ITConfig( RTC_IT_ALRA, ENABLE );                // Enable the RTC Wakeup Interrupt
                fSuccess = RTC_AlarmCmd( RTC_Alarm_A, ENABLE );     // Enable the alarm  A

                if( fSuccess == TRUE )
                {
                    /////////////////////////////////////////////////
                    // CONFIGURE WKUP EXTI LINE 17 (from manual)
                    /////////////////////////////////////////////////
                    // Configure EXTI line
                    EXTI_ClearITPendingBit( EXTI_Line17 );
                    EXTI_InitStructure.EXTI_Line    = EXTI_Line17;      // Line 17 connected to RTC ALARMA event
                    EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Interrupt;
                    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
                    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
                    EXTI_Init( &EXTI_InitStructure );

                    /////////////////////////////////////////////////
                    // CONFIGURE NVIC INTERRUPT VECTOR
                    /////////////////////////////////////////////////
                    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
                    NVIC_Init( &NVIC_InitStructure );

                    // Indicate this interrupt has been enabled
                    gfIsInterruptTimeMatchEnabled = TRUE;
                }
            }
        }
        else
        {
            /////////////////////////////////////////////////
            // CONFIGURE NVIC INTERRUPT VECTOR
            /////////////////////////////////////////////////
            NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
            NVIC_Init( &NVIC_InitStructure );

            // Indicate this interrupt has been disabled
            gfIsInterruptTimeMatchEnabled = FALSE;

            fSuccess = TRUE;
        }
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcGetInterruptCounter( UINT32 *pdwInterruptPinA0Counter, UINT32 *pdwInterruptOnTimeMatchCounter )
//!
//! \brief  Return the value of the amount of interruptions
//!
//! \param[in]  pdwInterruptPinA0Counter        interruption counter for event: PA0 on rising
//!
//! \param[in]  pdwInterruptOnTimeMatchCounter  interruption counter for event: Time Match (hours/minutes/seconds)
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcGetInterruptCounter( UINT32 *pdwInterruptPinA0Counter, UINT32 *pdwInterruptOnTimeMatchCounter )
{
    BOOL fSuccess = FALSE;

    if( pdwInterruptOnTimeMatchCounter != NULL )
    {
        *pdwInterruptOnTimeMatchCounter     = gdwInterruptWKUPRolloverCounter;

        fSuccess = TRUE;
    }


    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_IRQ_HNDLR( void )
//!
//! \brief  interruption handler
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_IRQ_HNDLR( void )
{
    if( EXTI_GetITStatus( RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_LINE ) == SET )
    {
        // Clear the Wakeup Button EXTI line pending bit
        EXTI_ClearITPendingBit( RTC_INT_WAKEUP_REED_WITCH_1_EXT_INT_LINE );

        gdwInterruptPinA0Counter++;
    }
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RTC_Alarm_IRQHandler( void )
//!
//! \brief  interruption handler
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RTC_Alarm_IRQHandler( void )
{
    if( RTC_GetITStatus( RTC_IT_ALRA ) == SET )
    {
        // Clear the WKUP pending bit
        RTC_ClearITPendingBit( RTC_IT_ALRA );
        // Clear the Line 17 pending bit (Line 17 connected to RTC ALARMA event)
        EXTI_ClearITPendingBit( EXTI_Line17 );

        gdwInterruptWKUPRolloverCounter++;
    }
}
#endif

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcSetBackupRegister( UINT8 bBkpRegIndex, UINT32 dwValue )
//!
//! \brief  write a uint32 into a RTC backup register
//!
//! \param[in]  bBkpRegIndex        index:0...19
//!
//! \param[in]  dwValue             val max size 4 bytes
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcSetBackupRegister( UINT8 bBkpRegIndex, UINT32 dwValue )
{
    BOOL fSuccess = FALSE;

    if( bBkpRegIndex < RTC_BACKUP_DATA_REGS_AMOUNT )
    {
        RTC_WriteBackupRegister( dwBakupDataRegisters[bBkpRegIndex], dwValue );

        fSuccess = TRUE;
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL RtcGetBackupRegister( UINT8 bBkpRegIndex, UINT32 *pdwValue )
//!
//! \brief  read a uint32 RTC backup register
//!
//! \param[in]  bBkpRegIndex        index:0...19
//!
//! \param[in]  dwValue             val max size 4 bytes
//!
//! \return BOOL
//!             TRUE if no error on the operation.
//!             FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL RtcGetBackupRegister( UINT8 bBkpRegIndex, UINT32 *pdwValue )
{
    BOOL fSuccess = FALSE;

    if( bBkpRegIndex < RTC_BACKUP_DATA_REGS_AMOUNT )
    {
        if( pdwValue != NULL )
        {
            *pdwValue = RTC_ReadBackupRegister( dwBakupDataRegisters[bBkpRegIndex] );

            fSuccess = TRUE;
        }
    }

