gutanclan/stm32Bootloader/drivers/rtc/rtc.c
    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcPrintClockStatus( ConsolePortEnum eConsole )
//!
//! \brief  prints the status of Rtc clock
//!
//! \param[in]  eConsole   Console Id to print message
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
//void RtcPrintClockStatus( ConsolePortEnum eConsole )
//{
//    RtcDateTimeStruct   tDateTime;
//    UINT32              dwEpoch  = 0;
//    BOOL                fSuccess = FALSE;
//
//    fSuccess = RtcIsRtcConfigured();
//    RtcDateTimeGet( &tDateTime );
//    dwEpoch = RtcDateTimeToEpochSeconds( &tDateTime );
//
//    ConsolePrintf( eConsole, "----------------------\r\n" );
//    ConsolePrintf( eConsole, "RTC DATE TIME\r\n" );
//    ConsolePrintf( eConsole, "IsRtcConfigured:\t%d\r\n", fSuccess );
//    ConsolePrintf(
//        eConsole, "DateTime:\t\t%04d-%02d-%02d %02d:%02d:%02d\r\n",
//        ( tDateTime.bYear + RTC_CENTURY ),
//        tDateTime.eMonth,
//        tDateTime.bDate,
//        tDateTime.bHour,
//        tDateTime.bMinute,
//        tDateTime.bSecond );
//    ConsolePrintf( eConsole, "EpochTime:\t\t%d\r\n", dwEpoch );
//}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcPrintInterruptStatus( ConsolePortEnum eConsole )
//!
//! \brief  prints the status of Rtc interruptions
//!
//! \param[in]  eConsole   Console Id to print message
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
//void RtcPrintInterruptStatus( ConsolePortEnum eConsole )
//{
//    UINT32 dwInterruptPinA0Counter      = 0;
//    UINT32 dwInterruptOnTimeMatchCounter= 0;
//
//    RtcGetInterruptCounter( &dwInterruptPinA0Counter, &dwInterruptOnTimeMatchCounter );
//
//    ConsolePrintf( eConsole, "----------------------\r\n" );
//    ConsolePrintf( eConsole, "RTC INTERRUPTIONS\r\n" );
//    ConsolePrintf( eConsole, "IsInterruptTimeMatchEnabled:\t\t%d\r\n", gfIsInterruptTimeMatchEnabled );
//    ConsolePrintf( eConsole, "\tInterruptTimeMatchCounterVal:\t%d\r\n", dwInterruptOnTimeMatchCounter );
//    ConsolePrintf( eConsole, "IsInterruptPA0Enabled:\t\t\t%d\r\n", gfIsInterruptPA0Enabled );
//    ConsolePrintf( eConsole, "\tIsInterruptPA0CounterVal:\t%d\r\n", dwInterruptPinA0Counter );
//}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcPrintBckupStatus( ConsolePortEnum eConsole )
//!
//! \brief  prints the status of Backup registers
//!
//! \param[in]  eConsole   Console Id to print message
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
//void RtcPrintBckupStatus( ConsolePortEnum eConsole )
//{
//    UINT32 dwRegValue = 0;
//
//    ConsolePrintf( eConsole, "----------------------\r\n" );
//    ConsolePrintf( eConsole, "RTC BACKUP REGS\r\n" );
//
//    for( UINT8 bRegCounter = 0; bRegCounter < RTC_BACKUP_DATA_REGS_AMOUNT ; bRegCounter++ )
//    {
//        RtcGetBackupRegister( bRegCounter, &dwRegValue );
//
//        ConsolePrintf( eConsole, "[%02d:0x%02X]", bRegCounter, dwRegValue );
//
//        if( bRegCounter%5 == 4 )
//        {
//            ConsolePrintf( eConsole, "\r\n" );
//        }
//    }
//}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void RtcPrintDateTime( ConsolePortEnum eConsole )
//!
//! \brief  Print the RTC Date Time
//!
//! \param[in]  eConsole   Console Id to print message
//!
//! \return void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
//void RtcPrintDateTime( ConsolePortEnum eConsole )
//{
//    RtcDateTimeStruct       tDateTime;
//    CHAR                    cTimestampBuffer[32];
//
//    RtcDateTimeGet(&tDateTime);
//
//    snprintf( &cTimestampBuffer[0], sizeof(cTimestampBuffer), "%04u-%02u-%02u,%02u:%02u:%02u",
//                ( tDateTime.bYear + RTC_CENTURY ),
//                tDateTime.eMonth,
//                tDateTime.bDate,
//                tDateTime.bHour,
//                tDateTime.bMinute,
//                tDateTime.bSecond
//                );
//
//    ConsolePrintf(eConsole, &cTimestampBuffer[0]);
//}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn         void RtcTest( void )
//!
//! \brief      Test function for Debugging purposes.
//!
//! \return     void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void RtcTest( void )
{
    // #### TEST CODE ####
    BOOL                fSuccess                        = FALSE;
    BOOL                fReturn                         = FALSE;
    UINT32              dwInterruptPinA0Counter         = 0;
    UINT32              dwInterruptWKUPRolloverCounter  = 0;
    UINT32              dwDelay                         = 1;
    RtcDateTimeStruct   tDateTime;

    fSuccess = RtcInitialize( RTC_SOURCE_CLOCK_LSI );

    if( fSuccess )
    {
        fSuccess &= RtcIsRtcConfigured();

        if( fSuccess )
        {
            tDateTime.bSecond       = 0;
            tDateTime.bMinute       = 30;
            tDateTime.bHour         = 17;
            tDateTime.eDayOfWeek    = RTC_DAY_WEDNESDAY;
            tDateTime.bDate         = 1;
            tDateTime.eMonth        = RTC_MONTH_MAY;
            tDateTime.bYear         = 13;
            //////////////////////////////////////
            // test the epoch functions are working
            //////////////////////////////////////
            UINT32 dwEpoch = RtcDateTimeToEpochSeconds( &tDateTime );
            RtcDateTimeStructInit( &tDateTime );
            RtcEpochSecondsToDateTime( dwEpoch, &tDateTime );
            //////////////////////////////////////

            fSuccess = RtcDateTimeSet( &tDateTime );

            RtcDateTimeStructInit( &tDateTime );
            //get time
            fSuccess = RtcDateTimeGet( &tDateTime );
            //print time

            //////////////////////////////////////
            // test PA0 interruptions
            //////////////////////////////////////
            //#define TEST_INT_PA0
            #if defined(TEST_INT_PA0)
            RtcInterruptPinA0Enable( TRUE );

            dwDelay = 1;
            while( dwDelay );           // use debugger break point to set delay val to zero

            RtcGetInterruptCounter( &dwInterruptPinA0Counter, &dwInterruptWKUPRolloverCounter );

            RtcInterruptPinA0Enable( FALSE );

            dwDelay = 1;
            while( dwDelay );           // use debugger break point to set delay val to zero

            RtcGetInterruptCounter( &dwInterruptPinA0Counter, &dwInterruptWKUPRolloverCounter );
            #endif
            //////////////////////////////////////

            //////////////////////////////////////
            // test TimeRollover interruptions
            //////////////////////////////////////
            //#define TEST_INT_ROLLOVER
            #if defined(TEST_INT_ROLLOVER)
            UINT8 bTimeMatchVal = 1;
            RtcInterruptWakeupOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_SECOND, bTimeMatchVal );

            dwDelay = 1;
            while( dwDelay );           // use debugger break point to set delay val to zero

            RtcInterruptWakeupOnTimeMatch( RTC_INT_WKUP_ON_TIME_MATCH_NONE, 0 );
            dwDelay = 1;
            while( dwDelay );           // use debugger break point to set delay val to zero
            #endif
            //////////////////////////////////////


            // Test RTC backup regs
            UINT32 dwRegVal = 0;
            RtcGetBackupRegister( 0 , &dwRegVal );
            RtcSetBackupRegister( 0 , 0x1234 );
            RtcGetBackupRegister( 0 , &dwRegVal );
            RtcGetBackupRegister( 0 , &dwRegVal );
        }
        else
        {
            //drop error
        }
    }
    else
    {
        // Error. Rtc not initialized
    }

    while(1);
    // #### --------- ####
}
